Функция ПолучитьНастройки() Экспорт
	
	Результат = Новый Структура();
	
	Для Каждого Реквизит Из Метаданные.Справочники.НастройкиПодключения.Реквизиты Цикл
		Результат.Вставить(Реквизит.Имя);
	КонецЦикла;
	
	Запрос = Новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПодключения.АдресСервера КАК АдресСервера,
	|	НастройкиПодключения.АдресИИ КАК АдресИИ,
	|	НастройкиПодключения.ТокенИИ КАК ТокенИИ,
	|	НастройкиПодключения.ПользовательБД КАК ПользовательБД,
	|	НастройкиПодключения.СерверБД КАК СерверБД,
	|	НастройкиПодключения.ИмяБД КАК ИмяБД,
	|	НастройкиПодключения.ПортБД КАК ПортБД,
	|	НастройкиПодключения.ПарольБД КАК ПарольБД
	|ИЗ
	|	Справочник.НастройкиПодключения КАК НастройкиПодключения";
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	