// Формирует текст JSON на основании структуры или соответствия
//
// Параметры:
//  Данные - Структура, Соответствие - Данные для формирования
// 
// Возвращаемое значение:
//  Строка - Строка в формате JSON
//
Функция СформироватьТекстJSON(Знач Данные, Знач ИмяСобытия) Экспорт
		
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, " ", ,
		ЭкранированиеСимволовJSON.СимволыВнеBMP, Истина, Истина, Ложь, , Истина);
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	Попытка
		ЗаписатьJSON(ЗаписьJSON, Данные);
		ТекстJSON = ЗаписьJSON.Закрыть();
	Исключение
		ТекстJSON = "";	
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки); 
	КонецПопытки;
	
	Возврат ТекстJSON;
	
КонецФункции

// Читает содержимое JSON и преобразовывает его в структуру или соответствие.
//
// Параметры:
//  ТекстJSON    - Строка - текст в формате JSON.
//  Соответствие - Булево - преобразовать в соответствие. Если параметру установлено
//                 значение Ложь, данные преобразуются в Структуру.
//
// Возвращаемое значение:
//  Структура или Соответствие.
//
Функция ПрочитатьСодержимоеJSON(Знач ТекстJSON, Знач Соответствие = Ложь) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Данные = ПрочитатьJSON(ЧтениеJSON, Соответствие);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Данные;
	
КонецФункции

// Останавливает выполнение кода на заданное время.
//
// Параметры:
//  ВремяПриостановки - Число - время ожидания в секундах.
//
Процедура Пауза(Знач ВремяПриостановки) Экспорт
    
    ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
    ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
    
    Если ФоновоеЗадание = Неопределено Тогда
        Параметры = Новый Массив;
        Параметры.Добавить(ВремяПриостановки);
        ФоновоеЗадание = ФоновыеЗадания.Выполнить("ОбщегоНазначения.Пауза", Параметры);
    КонецЕсли;
        
    Попытка
        ФоновоеЗадание.ОжидатьЗавершенияВыполнения(ВремяПриостановки);
    Исключение
        Возврат;
    КонецПопытки;
    
КонецПроцедуры
